src/main/resources/XML/Update/update.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.Insurer.com/webservices/">  
    <soapenv:Header> 
        <web:Authenticate_Info> 
            <!--Optional:-->  
            <web:UserName>IRDAUSER</web:UserName>  
            <!--Optional:-->  
            <web:Password>IRDAUSER</web:Password>  
            <web:EntityId>31</web:EntityId> 
        </web:Authenticate_Info> 
    </soapenv:Header>  
    <soapenv:Body> 
        <web:UpdateComplaint> 
            <!--Optional:-->  
            <web:InputElement> 
                <Complaints> 
                    <Complaint> 
                        <IRDA_Token_Number>07-24-002121</IRDA_Token_Number>  
                        <Status_Change_Date>18-07-2024</Status_Change_Date>  
                        <Complaint_Status_Id>1</Complaint_Status_Id>  
                        <Trans_Login_Id>SILICADMIN</Trans_Login_Id>  
                        <Option>1</Option>  
                        <Mode>2</Mode>  
                        <Entity_Complaint_Ref_Number>TEST620898</Entity_Complaint_Ref_Number>
                    </Complaint> 
                </Complaints> 
            </web:InputElement> 
        </web:UpdateComplaint> 
    </soapenv:Body> 
</soapenv:Envelope>